# """ 08 Допустимые значение времени
#
# Напишите программу, которая
# - запрашивает у пользователя часы и минуты
# - и проверяет, являются ли они допустимыми значениями времени.
#
# Пояснение:
# - часы должны быть в диапазоне 0-23;
# - минуты - в диапазоне 0-59
#
# Рекомендации:
# Не забывайте о константах!
#
# Пример вывода:
# Введите часы: 25
# Введите минуты: 30
# Некорректное время.
#
# """
#
#
# hours, minutes = 25, 30  # Некорректное время.
# # hours, minutes = 23, 79  # Некорректное время.
# # hours, minutes = 15, 30  # Корректное время.
HOURS_MAX = int(input('Введите часы: ')
MINUTES_MAX = int(input('Введите минуты: ')
                  if HOURS_MAX = 0