"""01
Напишите программу, которая запрашивает у пользователя
- его имя,
- возраст
- и любимый цвет,
а затем выводит краткую анкету в формате:
"Меня зовут [имя], мне [возраст] лет, и мой любимый цвет — [цвет]."

Пример вывода:
Введите имя: Анна
Введите возраст: 22
Введите любимый цвет: синий
Меня зовут Анна, мне 22 лет, и мой любимый цвет — синий.
"""




""" 02 Напишите программу, которая выводит на экран следующую строку несколькими способами:
Она сказала: "Привет!"
Пример вывода:
Она сказала: "Привет!"
Она сказала: "Привет!"
Она сказала: "Привет!"
"""






""" 03 Напишите программу, которая выводит следующий текст:
Пример вывода:
Список дел:
	Учеба
	Уборка
	Спорт
"""

""" 04 Напишите программу, которая запрашивает 
- расстояние (в километрах) 
- и среднюю скорость автомобиля (в км/ч). 
Программа должна вывести время, которое потребуется, чтобы преодолеть указанное расстояние.

Пример вывода:
Введите расстояние (в км): 150  
Введите среднюю скорость (в км/ч): 50  
Время в пути: 3.0 часов
"""

"""4.1.* Доработайте программу, чтобы она выводила время, которое потребуется, 
чтобы преодолеть указанное расстояние в часах и минутах (без дробной части).
Пример вывода:
Введите расстояние (в км): 400  
Введите среднюю скорость (в км/ч): 123  
Время в пути: 3 часа и 15 минут
"""
""" 05. Напишите программу, которая принимает от пользователя 
- количество дней до события 
- и выводит, сколько это недель и дней.

Пример вывода:
Введите количество дней до события: 45  
До события осталось: 6 недель и 3 дня.
"""

""" 06. Напишите программу, которая принимает
- расстояние в километрах, 
- расход бензина на 100 км 
- и цену за литр бензина. 
Программа должна рассчитать стоимость бензина для поездки.

Пример вывода:
Введите расстояние (в км): 300  
Введите расход бензина на 100 км: 8  
Введите цену за литр бензина: 60  
Стоимость бензина для поездки: 1440.0
"""

""" 07. Напишите программу, которая запрашивает у пользователя
- количество задач 
- и среднее время выполнения одной задачи (в минутах). 
Программа должна вывести общее время выполнения всех задач в формате часов и минут.

Пример вывода:
Введите количество задач: 5  
Введите среднее время выполнения одной задачи (мин): 40  
Общее время: 3 часа и 20 минут
"""

""" 08. Напишите программу, которая
- считывает число "n" 
- и вычисляет выражение "n + nn + nnn",
  где "nn" — это число "n", записанное дважды, а "nnn" — трижды.

Пример вывода:
Введите число: 5
Значение выражения: 615
"""

""" 09. Напишите программу, которая
- считывает четырёхзначное число 
- и меняет местами первую и последнюю цифры.

Пример вывода:
Введите четырёхзначное число: 1234
Число после изменения: 4231
"""